{"pageProps":{"article":{"name":"Tester Application","body":"<h3>What is a Tester?</h3>The role of a Tester in the team is to find bugs, or issues within the client and report them to the developers. You may find yourself reporting game crashes, mods that do not work as intended or helping other testers check problems within the client.<br/><br/><b>A typical day for a tester involves the following:</b><br/><br/><ul><li>Checking the Discord for announcements and/or new features to test</li><li>Communicating with other testers/developers to fix bugs</li><li>Reporting bugs</li><li>Attempting to break the game</li><li>Playing the game</li></ul><br/><br/><h3>How to apply</h3>To apply, please simply fill out <a href=\"https://forms.gle/o4dbPNes9iXqCjGN6\">this</a> form.<br/><br/>Please do not share your personal information (e.g. full real name, address) in your application. If we require any more information other than what was asked in the application, we will make sure to contact you regarding it. If you have not received any response to your application within 30 days of it being sent, it means that you got denied. Please note that only the successful applicants will receive a response to their application.<br/><br/>Do not contact any staff members regarding your application, as it will result in an instant denial. ","link":"tester-application","author":"kirillsaint"},"category":{"name":"General Information","icon":"/assets/icons/categories/general.svg","description":"Partnerships, staff applications, and FAQs.","link":"general","articles":[{"name":"Youtuber/Twitch Partner Program","body":"<h3>Benefits:</h3><ul><li>Custom Cape, Bandana, Shield and Hat on our shop</li><li>Premium+ Perks</li><li>Access to all cosmetics on Silent Client</li><li>Ability to change Twitch/Youtube Icon</li><li>Private Discord access with our development/administration teams</li></ul><br/><h3>Requirements</h3><h6>Youtube:</h6><ul><li>Have a passion for Minecraft content</li><li>Have an active Youtube channel (at least 3 videos in the last month around MC)</li><li>Have at least 200 Subscribers</li><li>Have at least 800-1000 Monthly Views on Channel Overall</li></ul><h6>Twitch:</h6><ul><li>Have a passion for Minecraft content</li><li>Have an active Twitch channel (at least 5 streams per month around MC)</li><li>Have at least 50 followers on Twitch</li><li>Have at least 10 viewers on average during your streams</li><li>Have at least 20 hours of MC streamed per month for the past three months.</li></ul><br/><h3>Application</h3>1) IGN:<br/>2) Youtube Channel (if applicable):<br/>3) Twitch Channel (if applicable):<br/>4) Most recent youtube video:<br/><br/><h3>How to Apply</h3>Anyone who is a content creator that meets our requirements listed out can contact creators@silentclient.net.","link":"youtuber-twitch-partner-program","author":"kirillsaint"},{"name":"Adding mods to Silent Client or Using it with Forge","body":"<h3>Can I add my own mods to Silent Client?</h3>No, you can't do it. Silent Client is a Minecraft client that includes a variety of custom-coded mods, FPS boosting features, custom cosmetics, and many more unique features. All mods and features need to be coded by hand by our developers (except a few which the original developer gave approval to us), which means that you won't be able to add mods on your own.<br/><br/>This also means that you cannot use Silent Client with Forge as the mods were coded for Silent Client and not Forge.","link":"adding-mods-to-silent-client-or-using-it-with-forge","author":"kirillsaint"},{"name":"Silent Client FAQ","body":"<h3>Frequently Asked Questions</h3>In this help article, you will find answers to the most asked questions. If you can't find your answer, please contact our customer support agents by creating a new support ticket: <a href=\"/new\">click here</a>.<br/><br/><h3>What is Silent Client?</h3>Silent Client is a Minecraft client with built-in FPS boost, mods and more. <br /> We are actively working to improve the client and add innovations that our players have asked us for.<br/><br/><h3>Does the Silent Client contain any viruses or trojans?</h3>The Silent Client contains no malicious software such as viruses or trojans. We use special software to protect our intellectual property in the launcher. Sometimes, this is flagged by antivirus services as a virus or a trojan due to how the protection software manipulates the machine language code. Please ignore these warnings and add an exception to your antivirus software for the Silent Client if this happens to you.<br/><br/><h3>Where can I report game bugs?</h3>If you have found a game bug and want to report it to get it fixed as soon as possible, please follow the instructions in this help article: <a href=\"/article/submit-a-bug-report\">click here</a>.<br/><br/><h3>What mods does the Silent Client use?</h3>The Silent Client supports many mods; too many to list here. The Silent Client team is constantly updating them alongside adding new mods. You can find all mods in the game by pressing the RIGHT-SHIFT key.<br/><br/><h3>Can I add my own mods?</h3>No, You cannot add your own mods to the Silent Client. We have explained it in the support article dedicated to this topic: <a href=\"/article/adding-mods-to-silent-client-or-using-it-with-forge\">click here</a>.<br/><br/><h3>Where can I find information about the latest Silent Client updates?</h3>You can find them in the following places:<br/>- News (<a href=\"https://silentclient.net/news\">click here</a>)<br/>- Discord (<a href=\"https://discord.gg/eaZYXEBRaE\">click here</a>)<br/>- Telegram (<a href=\"https://t.me/silent_client\">click here</a>)<br/>- VK (<a href=\"https://vk.com/silentclient\">click here</a>)","link":"silent-client-faq","author":"kirillsaint"},{"name":"Client Mod Application","body":"<img  src=\"/article_attachments/client-mod-application/client_mod_promo.png\" /><br/><b>Description of the position:</b> The Client Moderator position is the front page of the client. It’s a combination of in-game moderation, Discord moderation, and user support. We currently have 2 platforms for support; our Discord and Support Platform.<br/><br/>It is important that all aspects of our client are kept up-to-date, clean of toxicity and resourceful at all times. By joining our team, you will receive help from experienced staff members to develop an understanding of the problems most users face and how to resolve them.<br/><br/><h3>We want you to</h3><ul><li><span>Be curious, wanting to learn and improve yourself<br></span></li><li><span>Have a creative and open mind<br></span></li><li><span>Be able to work in a team to achieve bigger goals<br></span></li><li><span>Have the determination to make our client the best client possible<br></span></li><li><span>Excellent communication skills, able to form positive relationships with the rest of the team<br></span></li><li><span>Have the capability to receive criticism and listening to others feedback to better yourself, in a non-reactionary way<br></span></li><li><span>Ability to provide calm, mature and clear instructions to our playerbase&nbsp;</span></li></ul><br/><br/><h3>Bonus</h3><ul><li><span>Deep understanding of the features of the Silent Client</span></li><li><span>Knowledge of Windows and troubleshooting</span></li><li><span>Be able to speak fluently in different languages</span></li><li><span>Previous experience helping game players of all ages and backgrounds</span></li></ul><br/><br/><h3>Extra Notice</h3><ul class=\"wysiwyg-text-align-justify\"><li><strong>Personal information: </strong><span>Please do not give out your personal information (ex : full real name, email) in your application. If we are in need of any more information other than what was asked in the application, we will ask you for it.</span></li><li><strong>Application Responses: </strong><span>If you have not received any response to your application within 30 days of it being sent, this means you’ve gotten denied. Please note that only the successful applicants will receive a response to their application.</span></li><li><strong>If accepted: </strong><span>If your application was accepted, one of our Client Manager will add you on discord and contact you there. Further information will be disclosed there about joining the client moderation team.</span><span><br></span><span><br></span><span>Do not contact any staff members regarding your staff application as it will result in an instant denial. You can only apply for this position once every two months.</span></li></ul><br/><br/><h3>Application format</h3><ul><li><strong>Basic Information</strong></li><li><strong>Minecraft Username -&nbsp;</strong></li><li><strong>Previous Username </strong><span>(link your namemc if there’s multiple) </span><strong>-</strong></li><li><strong>Discord Username (ex : kirillsaint#1330) -</strong></li><li><strong>Country and Timezone -</strong></li><li><strong>Age </strong><span>(Note : you must be over 13 to apply) </span><strong>-</strong></li><li><strong>Gaming Twitter Link </strong><span>(If you have one) </span><strong>-</strong></li><li><strong>Fluent Languages Spoken -</strong></li><li><strong>Current rank </strong><span>(Premium or normal rank) </span><strong>- </strong></li></ul><br/><br/><h3>Staffing Experience</h3><ul><li><strong>Do you have any past experience as a staff member on a public server? </strong><span>(Minecraft, Discord, or other games)</span></li><li><strong>Why have you decided to apply for the Client Moderator position?</strong></li><li><strong>Using your past experiences (as staff or in real life), what skills have you learnt or developed that can benefit the client?</strong></li><li><strong>Were you previously demoted or fired and if so, what was the reason and what would you do differently?</strong></li><li><strong>Which Minecraft Server are you the most active on?</strong></li><li><strong>What would you consider your greatest strength, and your biggest weakness?</strong></li></ul><br/><br/><h3>Other information</h3><ul><li><strong>How much time could you contribute to the position?</strong></li><li><strong>Have you previously applied for Client Moderator, and if so, when was your last application?</strong></li><li><strong>Is there </strong><strong>anything else we should know or that you would like to add?</strong></li></ul><br/><br/><h3>How to Apply?</h3>Apply now by emailing the filled in format to <a href=\"mailto:clientmod@silentclient.net\">clientmod@silentclient.net</a> with the subject: <b>\"Silent Client Mod Team Application”</b> and you could be the next person to join the Client Moderation team!","link":"client-mod-application","author":"kirillsaint"},{"name":"Tester Application","body":"<h3>What is a Tester?</h3>The role of a Tester in the team is to find bugs, or issues within the client and report them to the developers. You may find yourself reporting game crashes, mods that do not work as intended or helping other testers check problems within the client.<br/><br/><b>A typical day for a tester involves the following:</b><br/><br/><ul><li>Checking the Discord for announcements and/or new features to test</li><li>Communicating with other testers/developers to fix bugs</li><li>Reporting bugs</li><li>Attempting to break the game</li><li>Playing the game</li></ul><br/><br/><h3>How to apply</h3>To apply, please simply fill out <a href=\"https://forms.gle/o4dbPNes9iXqCjGN6\">this</a> form.<br/><br/>Please do not share your personal information (e.g. full real name, address) in your application. If we require any more information other than what was asked in the application, we will make sure to contact you regarding it. If you have not received any response to your application within 30 days of it being sent, it means that you got denied. Please note that only the successful applicants will receive a response to their application.<br/><br/>Do not contact any staff members regarding your application, as it will result in an instant denial. ","link":"tester-application","author":"kirillsaint"}]}},"__N_SSG":true}