{"pageProps":{"article":{"name":"Adding More Memory (RAM) to your Silent Client","body":"<h3>When should I change the amount of allocated memory?</h3>\n\tWe all love to play Minecraft, especially when using high-resolution resource packs and shaders, but using such resources in Minecraft makes it power-hungry. It consumes a lot of memory (RAM) on your computer. If your game does not have enough memory allocated to it, its frames (FPS) may decrease, and you might start experiencing lag spikes (FPS drops), it may load slowly, and sometimes it might even crash. If you start experiencing any of the mentioned problems, you should consider using the built-in option to change the amount of allocated memory.\n\t<br/><br/>\n\t<h3>How can I add more memory to Minecraft on the Silent Client launcher?</h3>\n\t<span style=\"color:red\">Note:</span> we do not suggest allocating more than half of the available memory. You should keep the allocated memory between 2-4 GB, depending on how much total RAM your computer has.<br/><br/>\n\tIf you want to change the amount of allocated memory, you need to do the following:\n\t<ul>\n\t<li>Open the Silent Client launcher and click the \"Settings\" button, as shown in the screenshot below.\n\t<img src=\"https://imgur.com/xJQAlSI.png\" width=\"500px\" /></li>\n\t<li>Find \"Allocate RAM (MB)\" slider. You can click anywhere on the slider to change the amount of the allocated memory.\n\t<img src=\"https://imgur.com/V187uLo.png\" width=\"500px\"/>\n\t</li>\n\t</ul>","link":"adding-more-memory-ram-to-your-silent-client"},"category":{"name":"Support Center","icon":"/assets/icons/categories/support.svg","description":"Payment Support, Technical Support, and Vanilla Minecraft Problems.","link":"support","articles":[{"name":"Adding More Memory (RAM) to your Silent Client","body":"<h3>When should I change the amount of allocated memory?</h3>\n\tWe all love to play Minecraft, especially when using high-resolution resource packs and shaders, but using such resources in Minecraft makes it power-hungry. It consumes a lot of memory (RAM) on your computer. If your game does not have enough memory allocated to it, its frames (FPS) may decrease, and you might start experiencing lag spikes (FPS drops), it may load slowly, and sometimes it might even crash. If you start experiencing any of the mentioned problems, you should consider using the built-in option to change the amount of allocated memory.\n\t<br/><br/>\n\t<h3>How can I add more memory to Minecraft on the Silent Client launcher?</h3>\n\t<span style=\"color:red\">Note:</span> we do not suggest allocating more than half of the available memory. You should keep the allocated memory between 2-4 GB, depending on how much total RAM your computer has.<br/><br/>\n\tIf you want to change the amount of allocated memory, you need to do the following:\n\t<ul>\n\t<li>Open the Silent Client launcher and click the \"Settings\" button, as shown in the screenshot below.\n\t<img src=\"https://imgur.com/xJQAlSI.png\" width=\"500px\" /></li>\n\t<li>Find \"Allocate RAM (MB)\" slider. You can click anywhere on the slider to change the amount of the allocated memory.\n\t<img src=\"https://imgur.com/V187uLo.png\" width=\"500px\"/>\n\t</li>\n\t</ul>","link":"adding-more-memory-ram-to-your-silent-client"},{"name":"Game has no sound","body":"<h6>Check the in-game sound settings to make sure you haven't muted any sounds.</h6>\n\tIf you don't know where to find Minecraft sound & music settings, do the following: open Minecraft Options, then click on the \"Music & Sounds\" button.\n\t<img src=\"https://imgur.com/KRcjYJg.png\" width=\"400px\" />\n\t<img src=\"https://imgur.com/KfvHlDI.png\" width=\"400px\" />\n\t<br/><br/>\n\t<h6>Check your computer's volume mixer or any other sound software that you have installed to make sure you haven't muted the Silent Client.</h6>\n\tOpen the Silent Client launcher, then launch the game, and only then open the volume mixer.\n\t<br/><br/>\n\t<h6>Try reloading resources.</h6>\n\tTo do that, you need to connect to a server or singleplayer world, then press the ESC key on your keyboard, and then click on the \"Reload Resources\" button at the bottom left corner.\n\t<img src=\"https://imgur.com/xRp7hII.png\" width=\"500px\" />\n\t<br/><br/>\n\tIf the same issue persists, please <a href=\"/article/submit-a-bug-report\">submit a bug report</a> through the launcher immediately after having this issue.","link":"game-has-no-sound"},{"name":"Submitting a Bug Report","body":"<h3>How can I submit a bug report?</h3>\n\tIf you have found a bug, please do the following to report it to us:\n\t<ul>\n\t<li>Click on \"Submit Bug Report\" at the bottom of the launcher. If you have changed the language in the launcher, it will say something else.\n\t</li>\n\t<li>It will bring you to this page where you have to fill out some questions so we can know what is wrong.<br/> Make sure to explain the issue in detail and provide a screenshot or video if possible. A well-written bug report helps our Tech Support team and developers to reproduce and fix the bug. You can use <a href=\"https://workupload.com/\">https://workupload.com/</a> to upload screenshots and videos.<br/>Please do not remove any logs from your bug report! Our Tech Support and developers need your logs to see the exact cause of the issue! If your bug report is missing logs, restart the launcher, reproduce the problem, and submit a new bug report through the bottom of the launcher, as explained in this article above.</li>\n\t<li>Don't forget to click \"Submit\" when you have finished!</li>\n\t</ul>\n\tOnce you have submitted a bug report, our Tech Support team should review and respond to it within a few hours.","link":"submit-a-bug-report"}]}},"__N_SSG":true}